from gtts import gTTS
from playsound import playsound

mytext = 'মাতৃভাষার বাংলার প্রতি আমাদের ভালোবাসা আজন্মকাল। বাংলাভাষা আমাদের জন্য গর্বের, অহংকারের। শুধু ইংরেজি নয়, বাংলা লেখার চাহিদা বাড়ছে দিন দিন। বাংলা লেখা নিয়েই চমৎকার একটি ক্যারিয়ার গড়ার সুযোগ আছে। অনেকদিন ধরেই লিলাক কনটেন্ট রাইটিং ডিপার্টমেন্ট বাংলা নিয়ে কাজ করছে । চাইলে আপনিও বাংলা কনটেন্ট রাইটিং এর এই কোর্স করে আয়ের একটি স্বাধীন উৎস তৈরি করতে পারেন। বাংলা কনটেন্ট রাইটিং এর অভিজ্ঞ লেখকদের (যারা লিলাক এডুকেশনের প্রাক্তন শিক্ষার্ত্রী এবং সুদীর্ঘ সময় ধরে লেখালেখির সাথে সংযুক্ত আছেন) তত্ত্বাবধানে লেখা সংক্রান্ত বিভিন্ন বিষয় কোর্সভিত্তিক ভাবে শেখানো হয়।'
language = 'bn'
myobj = gTTS(text=mytext, lang=language, slow=False)

# store the voice in mp3 file
myobj.save("TextToVoice/output.mp3")

# Playing the converted file
playsound("TextToVoice/output.mp3")
